## Today's Topics
1. String Data Processing
2. Handling Missing Values
3. Structuring Data

<hr>

### String Data processing

In [1]:
import pandas as pd

In [2]:
horror_data = pd.read_csv('https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/horror-train.csv')

In [3]:
horror_data.head()

        id                                               text author
0  id26305  This process, however, afforded me no means of...    EAP
1  id17569  It never once occurred to me that the fumbling...    HPL
2  id11008  In his left hand was a gold snuff box, from wh...    EAP
3  id27763  How lovely is spring As we looked from Windsor...    MWS
4  id12958  Finding nothing else, not even gold, the Super...    HPL

In [4]:
horror_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19579 entries, 0 to 19578
Data columns (total 3 columns):
id        19579 non-null object
text      19579 non-null object
author    19579 non-null object
dtypes: object(3)
memory usage: 459.0+ KB

* How many authors are there ?

In [5]:
horror_data.author.unique()

array(['EAP', 'HPL', 'MWS'], dtype=object)

* What is the author distribution ?

In [6]:
horror_data.author.value_counts()

EAP    7900
MWS    6044
HPL    5635
Name: author, dtype: int64

* Find all the texts for EAP

In [11]:
horror_data[horror_data.author == 'EAP']['text'][:5]

0    This process, however, afforded me no means of...
2    In his left hand was a gold snuff box, from wh...
6    The astronomer, perhaps, at this point, took r...
7          The surcingle hung in ribands from my body.
8    I knew that you could not say to yourself 'ste...
Name: text, dtype: object

* Find out the row with longest text

In [13]:
horror_data['text_len'] = horror_data.text.str.len()

In [14]:
horror_data.head()

        id                                               text author  text_len
0  id26305  This process, however, afforded me no means of...    EAP       231
1  id17569  It never once occurred to me that the fumbling...    HPL        71
2  id11008  In his left hand was a gold snuff box, from wh...    EAP       200
3  id27763  How lovely is spring As we looked from Windsor...    MWS       206
4  id12958  Finding nothing else, not even gold, the Super...    HPL       174

In [15]:
c = horror_data.text

In [ ]:
c.str.

In [16]:
horror_data.text_len.max()

4663

In [17]:
horror_data[horror_data.text_len == 4663]

,id,text,author,text_len
9215,id27184,Diotima approached the fountain seated herself...,MWS,4663

* Not optimized

In [18]:
max(horror_data.text_len)

4663

* Filter the rows having the word 'hand' in it

In [20]:
horror_data[horror_data.text.str.contains('hand')].head()

,id,text,author,text_len
2,id11008,"In his left hand was a gold snuff box, from wh...",EAP,200
22,id18925,"On every hand was a wilderness of balconies, o...",EAP,115
23,id19925,With how deep a spirit of wonder and perplexit...,EAP,460
90,id03833,The ex queen gives me Idris; Adrian is totally...,MWS,130
147,id05876,I look on the hands which executed the deed; I...,MWS,224

* Find the rows with maximum number of words

In [22]:
horror_data['list_words'] = horror_data.text.str.split()

In [25]:
horror_data['num_words'] = horror_data.list_words.map(lambda r:len(r))

In [26]:
horror_data.num_words.max()

861

In [27]:
horror_data[horror_data.num_words == 861]

,id,text,author,text_len,list_words,num_words
9215,id27184,Diotima approached the fountain seated herself...,MWS,4663,"[Diotima, approached, the, fountain, seated, h...",861

#### Find the rows with maximum number of uppercase words (first char is uppercase)
- Break down text into words (already done, list_words)
- Find words with first character uppercase
- Do the count

In [30]:
s = 'hello'

In [31]:
s.istitle()

False

In [34]:
def f(r):
    return len(list(filter( lambda w: w.istitle(),r)))

horror_data['title_words'] = horror_data.list_words.map(f)

In [35]:
horror_data.title_words.max()

46

In [36]:
horror_data[horror_data.title_words == 46]

,id,text,author,text_len,list_words,num_words,title_words
9215,id27184,Diotima approached the fountain seated herself...,MWS,4663,"[Diotima, approached, the, fountain, seated, h...",861,46

### Handling Missing values
* Two stratagies
  - Fill the missing values
  - Delete the rows with missing values

In [37]:
titanic_data = pd.read_csv('https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/titanic-train.csv.txt')

In [38]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Inferance 
* Age, Cabin & Embarked has missing values

#### Q.Find all the rows in which age is missing

In [42]:
titanic_data[titanic_data.Age.isnull()].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q

### Q. Find all the rows in which Embarked is missing

In [43]:
titanic_data[titanic_data.Embarked.isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

### Q.Identify mean age of the people travelling in titanic

In [44]:
titanic_data.Age.mean()

29.69911764705882

In [46]:
titanic_data.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

### Q. Replace missing age by mean value, cabin & embarked

In [47]:
titanic_data.fillna({'Age':29.7,'Cabin':'NA','Embarked':'S'}, inplace=True)

In [48]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          891 non-null object
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

* Loading data again

In [49]:
titanic_data = pd.read_csv('https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/titanic-train.csv.txt')

### Q. Drop the rows in which age is missing

In [51]:
titanic_data.dropna(subset=['Age']).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Q. Drop all the rows in which any data is missing

In [53]:
titanic_data.dropna(inplace=True)

In [54]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 183 entries, 1 to 889
Data columns (total 12 columns):
PassengerId    183 non-null int64
Survived       183 non-null int64
Pclass         183 non-null int64
Name           183 non-null object
Sex            183 non-null object
Age            183 non-null float64
SibSp          183 non-null int64
Parch          183 non-null int64
Ticket         183 non-null object
Fare           183 non-null float64
Cabin          183 non-null object
Embarked       183 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 18.6+ KB

## Understanding Pivot Table

In [80]:
gap_data = pd.read_csv('https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/gapminder-FiveYearData.csv')

In [59]:
gap_data.sample(10)

           country  year          pop continent  lifeExp     gdpPercap
612         Guinea  1952    2664249.0    Africa   33.609    510.196492
934         Malawi  2002   11824495.0    Africa   45.009    665.423119
511       Ethiopia  1987   42999530.0    Africa   46.684    573.741314
192   Burkina Faso  1952    4469979.0    Africa   31.975    543.255241
1207          Peru  1987   20195924.0  Americas   64.134   6360.943444
754        Ireland  2002    3879155.0    Europe   77.783  34077.049390
788        Jamaica  1992    2378618.0  Americas   71.766   7404.923685
63       Australia  1967   11872264.0   Oceania   71.100  14526.124650
799          Japan  1987  122091325.0      Asia   78.670  22375.941890
1313  Saudi Arabia  1977    8128505.0      Asia   58.690  34167.762600

In [60]:
life_exp_country = gap_data.pivot_table(index='country', columns='year', values='lifeExp')

In [62]:
life_exp_country.head()

year,1952,1957,1962,1967,1972,1977,1982,1987,1992,1997,2002,2007
country,,,,,,,,,,,,
Afghanistan,28.801,30.332,31.997,34.020,36.088,38.438,39.854,40.822,41.674,41.763,42.129,43.828
Albania,55.230,59.280,64.820,66.220,67.690,68.930,70.420,72.000,71.581,72.950,75.651,76.423
Algeria,43.077,45.685,48.303,51.407,54.518,58.014,61.368,65.799,67.744,69.152,70.994,72.301
Angola,30.015,31.999,34.000,35.985,37.928,39.483,39.942,39.906,40.647,40.963,41.003,42.731
Argentina,62.485,64.399,65.142,65.634,67.065,68.481,69.942,70.774,71.868,73.275,74.340,75.320

* Find out most improved country in terms of life expectancy

In [63]:
life_exp_country['improvement'] = life_exp_country[2007] - life_exp_country[1952]

In [66]:
life_exp_country[life_exp_country.improvement == life_exp_country.improvement.max()]

year,1952,1957,1962,1967,1972,1977,1982,1987,1992,1997,2002,2007,improvement
country,,,,,,,,,,,,,
Oman,37.578,40.08,43.165,46.988,52.143,57.367,62.728,67.734,71.197,72.499,74.193,75.64,38.062

* Calculate lifeExp of the continent as mean of all the countries belonging to it

In [81]:
gap_data.columns

Index(['country', 'year', 'pop', 'continent', 'lifeExp', 'gdpPercap'], dtype='object')

In [82]:
ggap_data = gap_data.groupby(['continent','year'])

In [84]:
result = ggap_data.lifeExp.mean()

In [91]:
result

continent  year
Africa     1952    39.135500
           1957    41.266346
           1962    43.319442
           1967    45.334538
           1972    47.450942
           1977    49.580423
           1982    51.592865
           1987    53.344788
           1992    53.629577
           1997    53.598269
           2002    53.325231
           2007    54.806038
Americas   1952    53.279840
           1957    55.960280
           1962    58.398760
           1967    60.410920
           1972    62.394920
           1977    64.391560
           1982    66.228840
           1987    68.090720
           1992    69.568360
           1997    71.150480
           2002    72.422040
           2007    73.608120
Asia       1952    46.314394
           1957    49.318544
           1962    51.563223
           1967    54.663640
           1972    57.319269
           1977    59.610556
           1982    62.617939
           1987    64.851182
           1992    66.537212
           1997    68.020515
           2002    69.233879
           2007    70.728485
Europe     1952    64.408500
           1957    66.703067
           1962    68.539233
           1967    69.737600
           1972    70.775033
           1977    71.937767
           1982    72.806400
           1987    73.642167
           1992    74.440100
           1997    75.505167
           2002    76.700600
           2007    77.648600
Oceania    1952    69.255000
           1957    70.295000
           1962    71.085000
           1967    71.310000
           1972    71.910000
           1977    72.855000
           1982    74.290000
           1987    75.320000
           1992    76.945000
           1997    78.190000
           2002    79.740000
           2007    80.719500
Name: lifeExp, dtype: float64

In [86]:
continent_lifeExp_data = pd.DataFrame(result)

In [93]:
continent_lifeExp_data.head()

                  lifeExp
continent year
Africa    1952  39.135500
          1957  41.266346
          1962  43.319442
          1967  45.334538
          1972  47.450942

* Unstacking for converting inner index to column

In [88]:
continent_lifeExp_data.unstack()

             lifeExp                                                         \
year            1952       1957       1962       1967       1972       1977
continent
Africa     39.135500  41.266346  43.319442  45.334538  47.450942  49.580423
Americas   53.279840  55.960280  58.398760  60.410920  62.394920  64.391560
Asia       46.314394  49.318544  51.563223  54.663640  57.319269  59.610556
Europe     64.408500  66.703067  68.539233  69.737600  70.775033  71.937767
Oceania    69.255000  70.295000  71.085000  71.310000  71.910000  72.855000


year            1982       1987       1992       1997       2002       2007
continent
Africa     51.592865  53.344788  53.629577  53.598269  53.325231  54.806038
Americas   66.228840  68.090720  69.568360  71.150480  72.422040  73.608120
Asia       62.617939  64.851182  66.537212  68.020515  69.233879  70.728485
Europe     72.806400  73.642167  74.440100  75.505167  76.700600  77.648600
Oceania    74.290000  75.320000  76.945000  78.190000  79.740000  80.719500

In [95]:
import numpy as np

In [100]:
gap_data.pivot_table(index='continent',columns='year', values= 'lifeExp', aggfunc=np.mean )

year,1952,1957,1962,1967,1972,1977,1982,1987,1992,1997,2002,2007
continent,,,,,,,,,,,,
Africa,39.135500,41.266346,43.319442,45.334538,47.450942,49.580423,51.592865,53.344788,53.629577,53.598269,53.325231,54.806038
Americas,53.279840,55.960280,58.398760,60.410920,62.394920,64.391560,66.228840,68.090720,69.568360,71.150480,72.422040,73.608120
Asia,46.314394,49.318544,51.563223,54.663640,57.319269,59.610556,62.617939,64.851182,66.537212,68.020515,69.233879,70.728485
Europe,64.408500,66.703067,68.539233,69.737600,70.775033,71.937767,72.806400,73.642167,74.440100,75.505167,76.700600,77.648600
Oceania,69.255000,70.295000,71.085000,71.310000,71.910000,72.855000,74.290000,75.320000,76.945000,78.190000,79.740000,80.719500